In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {"names": ["sunyoung", "sunyoung", "sunyoung", "jungjae", "jungjae"],
           "year": [2018, 2017, 2016, 2015, 2018],
           "points": [2.9, 3.7, 4.6, 5.4, 6.9]}
df = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                          index=["one", "two", "three", "four", "five"])

In [3]:
df

       year     names  points penalty
one    2018  sunyoung     2.9     NaN
two    2017  sunyoung     3.7     NaN
three  2016  sunyoung     4.6     NaN
four   2015   jungjae     5.4     NaN
five   2018   jungjae     6.9     NaN

In [4]:
df['names']

one      sunyoung
two      sunyoung
three    sunyoung
four      jungjae
five      jungjae
Name: names, dtype: object

In [6]:
# df[1] #에러

In [7]:
df['year']

one      2018
two      2017
three    2016
four     2015
five     2018
Name: year, dtype: int64

In [8]:
df[ ['names', 'year'] ]

          names  year
one    sunyoung  2018
two    sunyoung  2017
three  sunyoung  2016
four    jungjae  2015
five    jungjae  2018

In [9]:
df

       year     names  points penalty
one    2018  sunyoung     2.9     NaN
two    2017  sunyoung     3.7     NaN
three  2016  sunyoung     4.6     NaN
four   2015   jungjae     5.4     NaN
five   2018   jungjae     6.9     NaN

In [10]:
df['penalty'] = 0.5

In [11]:
df

       year     names  points  penalty
one    2018  sunyoung     2.9      0.5
two    2017  sunyoung     3.7      0.5
three  2016  sunyoung     4.6      0.5
four   2015   jungjae     5.4      0.5
five   2018   jungjae     6.9      0.5

In [13]:
df['penalty'] = [0.1,0.2,0.3,0.4,0.5]

In [14]:
df

       year     names  points  penalty
one    2018  sunyoung     2.9      0.1
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.4
five   2018   jungjae     6.9      0.5

In [15]:
df['rank'] = np.arange(5)

In [16]:
df

       year     names  points  penalty  rank
one    2018  sunyoung     2.9      0.1     0
two    2017  sunyoung     3.7      0.2     1
three  2016  sunyoung     4.6      0.3     2
four   2015   jungjae     5.4      0.4     3
five   2018   jungjae     6.9      0.5     4

In [17]:
del df['rank']

In [18]:
df

       year     names  points  penalty
one    2018  sunyoung     2.9      0.1
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.4
five   2018   jungjae     6.9      0.5

In [19]:
df['num'] = np.arange(5)

In [20]:
df

       year     names  points  penalty  num
one    2018  sunyoung     2.9      0.1    0
two    2017  sunyoung     3.7      0.2    1
three  2016  sunyoung     4.6      0.3    2
four   2015   jungjae     5.4      0.4    3
five   2018   jungjae     6.9      0.5    4

In [21]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [22]:
df['debt'] = val

In [23]:
df

       year     names  points  penalty  num  debt
one    2018  sunyoung     2.9      0.1    0   NaN
two    2017  sunyoung     3.7      0.2    1  -1.2
three  2016  sunyoung     4.6      0.3    2   NaN
four   2015   jungjae     5.4      0.4    3  -1.5
five   2018   jungjae     6.9      0.5    4  -1.7

In [24]:
df['net_points'] = df['points'] - df['penalty']
df

       year     names  points  penalty  num  debt  net_points
one    2018  sunyoung     2.9      0.1    0   NaN         2.8
two    2017  sunyoung     3.7      0.2    1  -1.2         3.5
three  2016  sunyoung     4.6      0.3    2   NaN         4.3
four   2015   jungjae     5.4      0.4    3  -1.5         5.0
five   2018   jungjae     6.9      0.5    4  -1.7         6.4

In [26]:
df['high_points'] = df['net_points'] > 4.0

In [27]:
df

       year     names  points  penalty  num  debt  net_points  high_points
one    2018  sunyoung     2.9      0.1    0   NaN         2.8        False
two    2017  sunyoung     3.7      0.2    1  -1.2         3.5        False
three  2016  sunyoung     4.6      0.3    2   NaN         4.3         True
four   2015   jungjae     5.4      0.4    3  -1.5         5.0         True
five   2018   jungjae     6.9      0.5    4  -1.7         6.4         True

In [28]:
del df['high_points']

In [29]:
del df['net_points']

In [31]:
del df['num']

In [32]:
df

       year     names  points  penalty  debt
one    2018  sunyoung     2.9      0.1   NaN
two    2017  sunyoung     3.7      0.2  -1.2
three  2016  sunyoung     4.6      0.3   NaN
four   2015   jungjae     5.4      0.4  -1.5
five   2018   jungjae     6.9      0.5  -1.7

In [33]:
df[0:3]

       year     names  points  penalty  debt
one    2018  sunyoung     2.9      0.1   NaN
two    2017  sunyoung     3.7      0.2  -1.2
three  2016  sunyoung     4.6      0.3   NaN

In [36]:
#df['one']
#df[['one','two']]

In [37]:
df['two':'four']

       year     names  points  penalty  debt
two    2017  sunyoung     3.7      0.2  -1.2
three  2016  sunyoung     4.6      0.3   NaN
four   2015   jungjae     5.4      0.4  -1.5

In [38]:
df.loc['two']

year           2017
names      sunyoung
points          3.7
penalty         0.2
debt           -1.2
Name: two, dtype: object

In [39]:
df.loc['two':'four']

       year     names  points  penalty  debt
two    2017  sunyoung     3.7      0.2  -1.2
three  2016  sunyoung     4.6      0.3   NaN
four   2015   jungjae     5.4      0.4  -1.5

In [40]:
df.loc['two':'four', 'penalty']

two      0.2
three    0.3
four     0.4
Name: penalty, dtype: float64

In [41]:
df.loc[ : ,'year']

one      2018
two      2017
three    2016
four     2015
five     2018
Name: year, dtype: int64

In [42]:
df.loc['two':'four', ['year','names'] ]

       year     names
two    2017  sunyoung
three  2016  sunyoung
four   2015   jungjae

In [43]:
df.loc['two':'four', 'year':'names' ]

       year     names
two    2017  sunyoung
three  2016  sunyoung
four   2015   jungjae

In [44]:
df.loc['six', : ] = [2019, 'sunny', 9.9, 9.8, 9.7]

In [45]:
df

         year     names  points  penalty  debt
one    2018.0  sunyoung     2.9      0.1   NaN
two    2017.0  sunyoung     3.7      0.2  -1.2
three  2016.0  sunyoung     4.6      0.3   NaN
four   2015.0   jungjae     5.4      0.4  -1.5
five   2018.0   jungjae     6.9      0.5  -1.7
six    2019.0     sunny     9.9      9.8   9.7

In [46]:
df['year'] = df['year'].astype('int32')

In [47]:
df

       year     names  points  penalty  debt
one    2018  sunyoung     2.9      0.1   NaN
two    2017  sunyoung     3.7      0.2  -1.2
three  2016  sunyoung     4.6      0.3   NaN
four   2015   jungjae     5.4      0.4  -1.5
five   2018   jungjae     6.9      0.5  -1.7
six    2019     sunny     9.9      9.8   9.7

In [48]:
df.iloc[1, 0:2]

year         2017
names    sunyoung
Name: two, dtype: object

In [49]:
print(pd.__version__)

0.20.3

In [50]:
df.iloc[3:5, 0:2]

      year    names
four  2015  jungjae
five  2018  jungjae

In [51]:
df['year'] >2017

one       True
two      False
three    False
four     False
five      True
six       True
Name: year, dtype: bool

In [52]:
df.loc[df['year']>2017, : ]

      year     names  points  penalty  debt
one   2018  sunyoung     2.9      0.1   NaN
five  2018   jungjae     6.9      0.5  -1.7
six   2019     sunny     9.9      9.8   9.7

In [53]:
df

       year     names  points  penalty  debt
one    2018  sunyoung     2.9      0.1   NaN
two    2017  sunyoung     3.7      0.2  -1.2
three  2016  sunyoung     4.6      0.3   NaN
four   2015   jungjae     5.4      0.4  -1.5
five   2018   jungjae     6.9      0.5  -1.7
six    2019     sunny     9.9      9.8   9.7

In [54]:
df.loc[ df['names'] == 'sunyoung', ['names', 'points'] ]

          names  points
one    sunyoung     2.9
two    sunyoung     3.7
three  sunyoung     4.6